{
  "Men 500 m": [
    {
      "Preliminaries": [
        {
          "Heat 1": "1. Lukasz KUCZYNSKI (42.162)  \n2. Rostyslav LEONTENKO (+0.070)  \n3. Jonathan MOODY (+0.194)  \n4. Kosei HAYASHI (+0.217)  \n5. Brandon Yan Kai POK (+0.488)  \n\nKuczynski led from start to finish, opening a small gap early. Leontenko stayed close throughout and nearly closed the gap in the final lap. Moody held off Hayashi, who made a late charge but couldn't pass. No falls or penalties—clean race with consistent pacing."
        }
      ]
    },
    {
      "Heats": [
        {
          "Heat 1": "1. Steven DUBOIS (40.745) – led from start to finish with consistent laps.  \n2. Brandon KIM (+0.152) – stayed close throughout, second after first turn and held position.  \n3. Thomas NADALINI (+0.429) – started fourth, moved up late to claim third.  \n4. Diane SELLIER (+0.593) – strong early pace but faded slightly in final lap.  \n5. Peter JASZAPATI (+2.062) – last place, over 2 seconds behind, struggled for speed.  \n\nNo falls or penalties. Dubois controlled the race; top two qualified directly, Nadalini advanced as fastest loser."
        }
      ]
    },
    {
      "Rep. Quarterfinals": [
        {
          "Heat 1": "1. Abzal AZHGALIYEV (41.845)  \n2. Peter JASZAPATI (+0.048)  \n3. Rostyslav LEONTENKO (+0.511)  \n4. Chonlachart TAPROM (+1.259)  \n5. Huan-Chen LAI TSAI (no time)  \n\nAZHGALIYEV led from start to finish, pulling away early in the first lap. JASZAPATI made a strong push in the final laps to secure second. LEONTENKO held third throughout. TAPROM finished fourth, while LAI TSAI fell on the last corner of lap 4 and did not finish. No penalties. Race was controlled by the leader with minor shuffling behind."
        }
      ]
    },
    {
      "Rep. Semifinals": [
        {
          "Heat 1": "1. Peter JASZAPATI (42.256)  \n2. Brendan COREY (+0.055)  \n3. Zhanshuo LOU (+0.194)  \n4. Martin KOLENC (44.364, +2.108)  \n5. Abzal AZHGALIYEV (PEN)\n\nJASZAPATI started mid-pack but surged to the front on lap 4, holding off COREY who closed fast. LOU advanced from fifth to third with a strong final lap. KOLENC led early but faded after a slow fourth lap. AZHGALIYEV received a penalty, likely for lane infringement or contact. The top three battled closely, with just 0.2 seconds separating them at the line."
        }
      ]
    },
    {
      "Quarterfinals": [
        {
          "Heat 1": "1. Steven DUBOIS (40.799) – led from start to finish with consistent laps.  \n2. Brandon KIM (+0.023) – stayed close throughout, nearly catching Dubois in the final stretch.  \n3. Itzhak DE LAAT (+0.242) – started fifth but climbed to third after a strong fourth lap.  \n4. Denis NIKISHA (1:11.203) – slowed dramatically on lap 4, likely due to a technical issue or fall.  \n5. Oleh HANDEI – penalized, did not finish.  \n\nRace was tight between the top two, while De Laat secured the last qualification spot ahead of Nikisha, who struggled late."
        }
      ]
    },
    {
      "Semifinals": [
        {
          "Heat 1": "1. Steven DUBOIS (40.973)  \n2. Brandon KIM (+0.085)  \n3. Shaoang LIU (+0.122)  \n4. Jens VAN 'T WOUT (+0.175)  \n5. Itzhak DE LAAT (+0.505)  \n\nDubois led from the start and held off Kim, who closed the gap late. Liu and Van 't Wout battled closely for third, with no falls or penalties. The top two advanced to A Final, the next two to B Final."
        }
      ]
    },
    {
      "Finals": [
        {
          "Final A": "1. Steven DUBOIS (41.681) – led from start to finish with consistent laps.  \n2. Jordan PIERRE-GILLES (41.759, +0.078) – started 4th, surged late with fastest final lap.  \n3. Roberts KRUZBERGS (41.800, +0.119) – steady third, couldn't match the top two.  \n4. Shogo MIYATA (55.649) – fell early, continued but far behind.  \n5. Brandon KIM (56.813) – crashed on lap 3, lost significant time.  \n\nRace was decided early as Dubois controlled the pace; Pierre-Gilles narrowly edged Kruzbergs for silver."
        }
      ]
    }
  ]
}