{
  "athlete_biographies": {
    "013f54e5-d12a-4970-84bb-e2e40a383950": "Roberts Kruzbergs is a Latvian short track speed skater who has represented his country at the highest levels of international competition, including the Olympic Winter Games 2022, where he placed 9th in the 500m and 20th in the 1000m. He made history by becoming the first Latvian short track skater to win a World Cup event, claiming gold in the Men's 1000m in Montreal in October 2022. Kruzbergs has also achieved strong results at European Championships, finishing 4th in the 1500m in 2024 and 6th in the same event in 2025, while consistently competing in all three individual distances (500m, 1000m, 1500m) at World Championships. Born in Ventspils in 2001, he began skating there in 2006 alongside his brother Karlis, inspired by fellow Latvian skater Jekabs Saulitis, and trains rigorously six days a week with both on-ice and off-ice sessions. Notably, Kruzbergs follows a personal philosophy of “Stay calm and skate,” crediting his family, brother, and coach Stuart Horsepool as the most influential figures in his athletic career.",
    "01e4dcbf-164f-4a97-aef5-3587d81e1998": "Yanghun Ben Jung is a German short track speed skater of Korean origin, born on April 4, 2002, in Daejeon, South Korea, who moved to Germany in 2017. He represents Germany internationally and has competed in multiple ISU World Championships, achieving his best result with a 12th-place finish in the 500 m at the 2023 World Championships. Jung has also participated in European Championships, placing 11th in the 500 m in 2023, and has recorded several top-30 finishes in ISU World Cup and World Tour events, including a notable 23rd in the 500 m at the 2025 World Tour in Canada. Unusually, he made a significant lifestyle shift by leaving South Korea’s intense training environment—where he said fun was absent due to rigid discipline—for a more supportive atmosphere in Germany, where he began skating again with Eislauf-Verein Dresden. Fluent in Korean, German, and English, Jung balances his athletic career with hobbies like playing the piano and lives by the motto “No pain, no gain.”",
    "035de887-d22a-4161-8f98-03ffbea1fec1": "Chonlachart Taprom is a Thai short track speed skater born on May 8, 2007, in Chachoengsao, who began skating in 2016 at the IWIS International Training Center in Thailand. He has represented Thailand at major international events including the 2024 Winter Youth Olympic Games, where he placed 28th in the 1000m, and multiple ISU World Junior Championships and World Cups. His best individual result at the senior level was 28th in the 1500m at the 2023 World Championships, while consistently competing against top-tier athletes despite limited podium success. Notably, Taprom balances his athletic career with being a student and draws inspiration from fellow Thai skater Triphop Thongngam and ISU Council member Suwanna Silpa-archa, citing the motto: \"I never lose, either I win or I learn.\" An unusual aspect of his profile is that he hails from a country with minimal winter sports infrastructure, making his participation in global short track competitions a significant achievement in itself.",
    "05c24d5b-7213-468e-ac28-c431740f44ff": "Maxim Maximov is a Bulgarian short track speed skater born on 18 February 2006 in Sofia, where he began skating at the age of six. He has competed in multiple ISU World Cup and World Tour events, achieving notable results such as 22nd place in the Men's 1500 m at the 2023 World Cup in Germany and 28th in the Men's 500 m in China later that year. Maximov also participated in three consecutive ISU World Junior Championships (2022–2025), with his best result being 40th in the Men's 500 m in 2022. He cites Chinese skaters Liu Shaolin and Liu Shaoang, as well as Russian legend Victor An, as his idols, and credits coach Evgenia Radanova as the most influential person in his career. Unusually for a winter sport athlete from Bulgaria, Maximov is deeply passionate about Korean culture and biology, while managing a persistent ankle cyst that has affected his performance since the 2022/23 season—all while aiming for an Olympic gold medal.",
    "07b07e7b-b516-4d77-a204-91e3c504c294": "Radek Fajkus is a Czech short track speed skater who has represented his country at multiple World and European Championships, achieving his best individual result with a 15th-place finish in the 500m at the 2021 World Championships. He has also competed in various ISU World Cup events and participated in the 2018 Olympic Winter Games, where he was penalized in the 500m event. In addition to his ice skating career, Fajkus has represented Czechia in roller speed skating, including at the 2018 World Championships. Standing at 185 cm and hailing from Prague, he began skating in 2011 and cites Russian skater Victor An and Hungarian-Chinese skater Shaolin Liu as his idols. An unusual personal ritual is that he always puts on his left skate first, and he was influenced to start the sport by his parents, whom he credits as the most important people in his career.",
    "1109e535-8491-4985-857e-610f26178f4c": "Tae Sung Kim is a South Korean short track speed skater who has been active in international competitions since his junior career, achieving notable success at the World Junior Championships, including winning gold in the 1500m in 2020 and securing multiple podium finishes in 2019. He has competed consistently on the ISU World Cup circuit, with standout performances such as a first-place finish in the Men’s 500m at the 2022 Almaty World Cup, which he personally highlighted as a key achievement. In recent seasons, Kim has remained competitive in the 500m and 1000m events at ISU World Tour stops, recording top-10 finishes in 2024. Unusually, despite being an elite athlete, Kim continues to balance his skating career with being a student, representing Dankook University, and cites his mother as both his hero and the most influential person in his sporting journey. His ambition is to win Olympic gold, and he aims to \"become a big star\" in the sport.",
    "12d00681-72a5-4a5e-8b7f-888307030a79": "Yaroslav Morozov is a Ukrainian short track speed skater born on July 21, 2004, in Kyiv, who began skating in 2015 and represents Ukraine internationally. He has competed in multiple ISU World Cups, European Championships, and World Junior Championships, achieving notable results such as 37th in the Men's 1000 m at the 2022 World Juniors and participating in the 2025 World Championships in Beijing. His best recent performances include a 30th-place finish in the 500 m at the 2024 ISU World Cup and consistent appearances in the 1000 m and 1500 m events across the 2024–2025 ISU Short Track World Tour. Unusually, before focusing on skating, Morozov competed in taekwondo at the youth national level in Poland, showcasing his diverse athletic background. He cites \"the feeling of speed\" as his reason for choosing short track and lives by the philosophy: \"Never give up.\"",
    "17cf500c-d597-4fd2-ac27-62e8aabe6d11": "Diane Sellier is a male short track speed skater representing Poland, despite being born in France and initially competing for the French national team. He made his mark by becoming the first Polish male short track skater to win a World Cup gold medal, claiming victory in the 500m event in Almaty in 2022, and later earning a European Championships bronze in the 5000m relay in 2023 as part of Poland’s historic podium finish. Competing consistently at the highest level, he achieved a sixth-place finish in the 500m at the 2025 World Championships and reached the top ten in multiple World Cup events between 2022 and 2024. Unusually, Sellier struggled with mental health due to isolation while training far from home in France, which led him to switch allegiance to Poland in 2021 after being invited by his former coach Gregory Durand, where he found a supportive environment that revived his passion for the sport. Standing 173 cm tall and hailing from Gdańsk, Sellier aims to compete at the 2026 Winter Olympics in Milan-Cortina, skating under the motto: “I jump on the track to win.”",
    "1f32c0f8-b7d1-4442-a6a5-ab8763ab06d1": "Lucas Wareham is an Australian short track speed skater who began skating at age 14 at Macquarie Ice Rink in Sydney, inspired by a high school friend to take up the sport with the goal of surpassing him. Representing Australia on the international stage, Wareham has competed in multiple ISU World Cup and World Tour events, achieving notable results such as 25th place in the Men’s 1000 m at the 2024 ISU Short Track World Tour in South Korea and China. He also represented Australia at the 2022 World Junior Championships, finishing 17th in the 1500 m, and participated in the 2022 and 2025 World Championships across various distances. A student by profession, Wareham hails from Wahroonga, New South Wales, and skates for the Sydney Wings Ice Racing Club, balancing his athletic career with academic life. Unusually candid about the mental and physical challenges of elite sport, Wareham’s personal motto is “Enjoy the pain,” and he cites his father as his hero and greatest inspiration.",
    "21cc4579-3a1c-4a8a-bf39-5a7475bb319c": "Teun Boer is a Dutch short track speed skater who has represented the Netherlands in multiple international competitions, including the ISU World and European Championships. He achieved his best result at the 2024 European Championships by finishing second in the Men's 500 m event, showcasing his competitive strength at the continental level. Boer has also recorded strong performances in the ISU World Cup and World Tour events, with notable finishes such as fifth in the 500 m at the 2025 World Tour in the Netherlands and third in the 1000 m (1) at the 2022 World Cup in Canada. Born on May 5, 2001, in Nijmegen, he began skating at the local Triavium rink and balances his athletic career with being a student. Unusually, Boer underwent surgery to remove his tonsils in 2023 after they affected his performance during the 2022/23 season, highlighting a unique health challenge he overcame in his sporting journey.",
    "2560bda6-2a9e-4b0c-8adf-a91b273d71b2": "Brandon Kim is a competitive short track speed skater representing the United States, born on August 30, 2001, in Fairfax, Virginia. He has achieved notable results in international competitions, including a 5th-place finish in the Men's 500 m at the 2024 ISU Short Track World Tour in Korea and strong performances in World Cup events, such as 6th place in the 500 m in 2022 and 5th in the 1500 m (1) in 2023. As a junior skater, he showed promise with a 7th-place finish in the 500 m at the 2018 World Junior Championships and was named US Male Junior Developmental Skater of the Year in 2016. Brandon trains using a Korean-style regimen focused on explosive dry-land drills like jumps and imitations, which he credits for refining his ice technique, and he cites Russian legend Victor An as his idol. Outside skating, he is a computer science student and an avid supporter of the Philadelphia Eagles, inspired to take up the sport after watching the thrilling races at the 2010 Winter Olympics.",
    "270ef03a-79ea-488d-8444-5d8af2e4c06c": "Joshua Kah is an active short track speed skater representing New Zealand, despite being born in Mornington, Australia, and holding dual citizenship. He began skating at age four in Australia and has competed internationally since his World Cup debut in 2017 at just 16 years old, where he raced against renowned skater Victor An. Although he represented Australia early in his career, he switched to competing for New Zealand in 2022 following the suspension of Australia’s short track programme due to the pandemic, hoping to help build a competitive relay team. His best results include a 17th place in the Men's 500 m at a 2024 ISU World Cup event, while his performances at World Championships and Junior Championships have seen mid-pack finishes. Unusually, Kah balances his athletic career with academic pursuits, studying for a master's degree in mechatronic engineering, and he enjoys 3D printing and playing the piano in his spare time—reflecting his philosophy of \"training smarter, not harder.\"",
    "28a5fc1f-30c5-4a95-b82b-6c6fe56c6b70": "Fredrik PEDERSEN is a Norwegian short track speed skater born on April 7, 2006, who has been competing actively in international events since at least 2022. He has represented Norway at multiple ISU World Junior Championships, achieving his best result with a 6th place in the Men's 1500 m in 2024, and has also participated in senior competitions including the European Championships and ISU World Cup/World Tour events. His results show consistent participation across all distances—500 m, 1000 m, and 1500 m—with notable appearances at the 2024 and 2025 World Junior Championships and several ISU Short Track World Tour stops. While he has not yet achieved podium finishes at major senior championships, he continues to gain experience on the global stage, most recently competing in October 2025. Unusually, very little personal information is available about him, as details such as height, hometown, club, and hobbies are listed as \"N/A\", making it difficult to learn more beyond his competitive record.",
    "29659c64-b0e6-4e52-8121-665fcca355d7": "Martin Kolenc is a Croatian short track speed skater who has represented his country at multiple World and European Championships since making his international debut. He achieved his best individual result at the 2021 World Championships, finishing 16th in the 1500m, and reached the quarterfinals in the 500m at the 2022 World Championships in Montreal—a personal milestone he highlights as a career achievement. Competing consistently on the ISU World Cup and World Tour circuits, Kolenc recorded notable top-15 finishes in the 500m and 1000m events during the 2024–2025 season, including two 12th-place finishes in Seoul. Standing at 187 cm and hailing from Zagreb, where he began skating in 2008 with KBK Meteor, Kolenc balances his athletic career with academic pursuits, holding a master's degree in kinesiology from the University of Zagreb. Unusually for a winter sport athlete, he cites playing racing simulation games and the guitar as key hobbies, and has overcome significant adversity, including three knee surgeries due to a tumour discovered in 2018, while crediting his parents as the most influential figures in his sporting journey.",
    "29f872c9-cead-450c-9997-3b6d6dacc1e8": "Itzhak De Laat is a Dutch short track speed skater who has represented the Netherlands at the highest level, competing in multiple Olympic Games and World Championships since his World Cup debut in 2011. He achieved notable success by winning silver medals in both the 1500m and 3000m superfinal at the 2021 World Championships, and he earned a bronze in the 1500m at the 2024 European Championships. De Laat also reached the final of the 1000m at the 2022 Beijing Olympics, finishing fifth, and previously placed sixth in the 1500m at the 2018 PyeongChang Games. Beyond his athletic career, De Laat is an artist and designer who creates custom helmet designs for himself and other athletes, often inspired by heavy metal music. He began skating at age eight in Leeuwarden, cites his father as his biggest influence, and aims to compete until at least the 2026 Milan-Cortina Winter Olympics.",
    "2dea1d2c-3ff7-49de-b8b5-a98466f53d69": "Long SUN, representing China, is an active short track speed skater born on August 28, 2000, in Changchun and hailing from Beijing. He achieved a major milestone by winning gold in the Men's 1500m at the 2024 World Championships in Rotterdam, marking a breakthrough in his senior career after earlier success as a junior, including a world junior title in the 1000m in 2020. At the 2022 Winter Olympics, he placed 15th in the 500m and 25th in the 1500m, and has since shown consistent improvement, earning a fifth-place finish in the 500m at the 2025 World Championships in Beijing. Standing at 184 cm, SUN is known for his strong finishes and determination, inspired by Olympic champion Wu Dajing and guided by his personal philosophy: \"Never give up until the end.\" He aims to compete at the 2026 Winter Olympics in Milan-Cortina, continuing his journey in one of winter sport’s most demanding disciplines.",
    "2e32c658-7255-4a74-aa1e-3555a22db580": "Liam O'Brien is an Irish short track speed skater who has been actively competing at the international level, representing Ireland in multiple ISU World and European Championships. He achieved his best individual result at the 2024 Shanghai Trophy, finishing fifth in the Men's 1500 meters, and placed as high as 11th in the 500 meters at the same event. At the World Championships, his top finishes include a 25th place in the 1500 meters (2021) and 25th in the 1000 meters (2024), while his strongest European Championship result was 19th in the 1000 meters in 2024. O'Brien has also participated in numerous ISU World Cup and World Tour events, with consistent appearances in all distances, though he has not yet broken into the top ranks globally. Notably, personal details such as his height, hometown, skating club, and hobbies are not publicly available, making him a relatively private figure despite his active competition schedule.",
    "398f4d0a-6c05-40de-b3f1-8866b6ff5158": "Marcus Howard, representing the USA in short track speed skating, has established himself as a promising athlete on the international stage. He achieved a notable silver medal in the Men's 500 m at the 2023 ISU World Junior Championships and has consistently competed in senior events, including placing 21st and 22nd in the 1000 m and 500 m at the 2024 World Championships. Howard has also posted strong results in the ISU World Cup and Four Continents Championships, with top-10 finishes in multiple 500 m races. Unusually, he began his skating journey in inline skating at Pattison's West Skating Center in Federal Way, WA, which he credits for giving him an edge when transitioning to ice. At just 16, he moved away from home to join the US Speedskating FAST program in Salt Lake City, living with Olympic skater John Robert Celski—his idol—who inspired him to pursue the sport after a talk at his hometown rink.",
    "41802b7a-0a0c-48f4-9fe8-3776c419dcc6": "Brendan Corey is an Australian short track speed skater, born on January 21, 1997, in Fredericton, Canada, who represents Australia internationally due to his family heritage. He achieved a career highlight by finishing third in the Men's 1500m at the 2024 World Championships, and has also placed fifth in the 1500m at the 2023 Four Continents Championships and sixth in the same event at the 2023 World Championships. Competing at the 2022 Winter Olympics, he placed 15th in the 1000m and 21st in the 500m, marking solid performances on the sport’s biggest stage. Unusually, Corey began skating through ice hockey before switching to speed skating at age eight, citing a desire to \"skate fast\" rather than follow the puck, and later transitioned from representing Canada to Australia after a concussion derailed his Canadian team aspirations and a chance meeting with coach Richard Nizielski. Based in Melbourne, he cites Steven Bradbury as his idol and aims to compete at the 2026 Milan-Cortina Olympics while seeking his first World Cup podium finish.",
    "46283c04-b51a-47f3-ac99-fe66e7dd778d": "Janghyuk PARK is a South Korean short track speed skater who has represented his country at the highest levels of competition, including the 2022 Olympic Winter Games where he placed 7th in the Men's 1500m and 10th in the 1000m. He achieved notable success as a junior athlete, earning multiple podium finishes at the 2018 ISU World Junior Championships, including silver in the 1000m and 1500m SF, and bronze in the 1500m. On the senior circuit, Park secured third place in the 1500m at two ISU World Cup events during the 2021 season, demonstrating consistency in middle-distance events. Unusually, despite suffering a severe hand injury requiring 11 stitches during the 2022 Olympics, he returned to compete just two days later in another event, showcasing remarkable resilience. Park, who began skating in 2005 at Korea University influenced by his older sister, follows a unique personal philosophy of confronting jinxes head-on rather than avoiding them, believing that overcoming bad luck strengthens performance.",
    "4a9f8b2e-e3fa-4305-b1f6-df066c32d3c2": "Mark Csizmadia is a Hungarian short track speed skater born on May 4, 2005, who represents Ferencvarosi Torna Club in Budapest. He has competed in various international events, including the ISU World Junior Championships and multiple ISU World Cup and World Tour competitions, achieving notable results such as 21st in the 1500 m at the 2024 World Juniors and 26th in the 1500 m (2) at a 2023 World Cup event. His performances have primarily been in the 500 m, 1000 m, and 1500 m distances, with rankings typically in the middle to lower half of competitive fields. Csizmadia is still developing his career on the global stage, with recent participation in the 2025 ISU Short Track World Tour events in Italy and the Netherlands. Unusually, there is limited personal information available about him—such as height, hometown, or hobbies—suggesting a low public profile despite his active competition status.",
    "4c36e64c-a635-45b3-8947-7b41a9430ecb": "Zhanshuo LOU is a male short track speed skater representing Hong Kong (HKG), born on September 2, 2005. He has competed in multiple international events, including the ISU World Championships and World Junior Championships, achieving notable results such as 7th place in both the 1500 m and 500 m at the 2024 World Junior Championships. His performances in the ISU World Tour events include a strong 15th place in the 1500 m at the 2024 China leg and consistent top-30 finishes in various distances throughout the 2024–2025 season. While his personal details like height, hometown, and skating club are not publicly available, he remains an active competitor on the global short track circuit. Unusually, despite competing under Hong Kong, several of his competitions list China (CHN) as the host country, reflecting the regional dynamics of his participation.",
    "4db2541f-8c53-49cb-af7d-ff587761fd00": "Peter Jászapáti is a Hungarian short track speed skater born on February 7, 2003, in Szeged, representing Hungary in international competitions. He achieved notable success at the 2022 ISU World Junior Championships, earning a bronze medal in the 500 m and finishing fourth and ninth in the 1500 m and 1000 m events, respectively. His best senior result came at the 2025 European Championships, where he placed eighth in the 1000 m and ninth in the 500 m. Jászapáti has competed regularly on the ISU World Tour and World Cup circuits, with his top individual performance being a seventh-place finish in the 1000 m at the 2023 World Cup in Canada. He cites Russian short track legend Victor An as his sporting idol, reflecting his admiration for one of the sport’s most decorated athletes.",
    "4ddfb510-ee35-4c1b-a0c1-f7ba7a228594": "Yui Matsubayashi is a Japanese male short track speed skater, born on December 5, 2002, in Kobe, who has been competing actively since at least 2023. He represented Japan in multiple ISU World Cup and World Tour events during the 2023–2024 seasons, achieving notable results such as a fifth-place finish in the Men's 500 m at the 2023 Four Continents Championships and a 12th-place finish in the Men's 1500 m (2) in Canada. While his rankings have varied across distances, with top-20 finishes in several 1000 m and 1500 m races, he has faced challenges in maintaining consistent placements, particularly in the 500 m events during the 2024 World Tour season. Unusually for an elite athlete, Matsubayashi’s profession outside of skating is listed as a chef, blending culinary skills with high-level athletic competition. He cites Russian short track legend Victor An as both his hero and the most influential person in his career, highlighting An’s lasting impact on global short track athletes.",
    "4f8a2b6d-729e-436f-b348-b1d227e2d2e1": "Murat Tahtacı is a Turkish short track speed skater who has represented Turkey in various international competitions, including the ISU World Cup, European Championships, and World Junior Championships. He achieved his best result with a 9th-place finish in the Men's 500 m at the 2024 European Championships and also competed at the 2022 World Junior Championships, where he placed 15th in the same event. Born on August 14, 2002, in Erzurum, Turkey, Tahtacı began skating in 2000 at a young age, inspired by his brother and later citing Hungarian skater Shaolin Sándor Liu as his idol. A notable moment in his career came during the 2017/18 season when he suffered a serious injury during training, requiring 16 stitches in his neck after being cut by a skate. Despite setbacks, his ambition to compete at the Winter Olympics reflects his dedication to advancing Turkish presence in short track speed skating.",
    "50258917-cf59-4b67-8059-e8a94708cf33": "Adam Granasztoi is a Hungarian short track speed skater born on November 23, 2005, who has been competing actively since he began skating at the age of six with Ferencvarosi Torna Club in Budapest. He represented Hungary at the ISU World Junior Short Track Speed Skating Championships, finishing 23rd in the Men's 1000 m and 24th in the Men's 1500 m in 2024, and placed 30th in the 1500 m event in 2025. Granasztoi also competed in the ISU Short Track World Tour, where he ranked 60th in the Men's 500 m during the 2024 season in South Korea. While his results highlight his development on the international stage, none of his performances have yet yielded points or podium finishes. An unusual aspect of his profile is that despite being an active elite athlete, details such as his height, hometown, and place of birth remain officially unlisted.",
    "50ac7787-2631-46d7-8d95-edc0c560a7ff": "Andrew Heo is an American short track speed skater who has represented the USA in multiple international competitions, including the 2022 Olympic Winter Games where he placed seventh in the Men's 1000m and 28th in the 1500m, marking a breakthrough performance that significantly boosted his confidence. He has achieved notable success at the Four Continents Championships, earning silver in the 500m and finishing second overall in 2022, along with a bronze in the 500m in 2023, while also delivering consistent performances in ISU World Cup and World Tour events, including a fifth-place finish in the 500m in late 2024. Born in Philadelphia and raised in Salt Lake City after moving there at age 15 to train with the US Speedskating FAST program, Heo comes from a supportive Korean-American family and credits them as the most influential force in his career. Unusually, he maintains a personal ritual of looking at a scar on his left forearm—sustained in a 2019 training accident—as a reminder of his perseverance, a practice inspired by his father’s advice, and he always puts on his left skate first before races. Fluent in both English and Korean, Heo has reconnected with his Korean heritage in recent years, actively working to improve his speaking skills, and he aims to win an Olympic medal at the 2026 Games in Milan-Cortina.",
    "530dda22-2d58-4a73-8a5f-be5ed4d3c203": "Eklavya Jagal is an Indian short track speed skater born on February 14, 2007, who is currently active in international competitions. He represented India at the 2024 ISU World Junior Short Track Speed Skating Championships in Poland, finishing 51st in the 1000 m, 55th in the 1500 m, and 47th in the 500 m events. Jagal has also competed in the ISU Short Track World Tour, with recorded results from 2024 to 2025, including a best placement of 54th in the 1000 m during the December 2024 event in South Korea. His participation marks him as one of the few Indian athletes competing at this level in winter sports, highlighting his role as a pioneer for short track skating in India. Notably, several personal details such as his height, hometown, and skating club remain unlisted in official records.",
    "5445c3b6-260c-4627-aff7-5c87accb1e3c": "Adil Galiakhmetov is a Kazakh short track speed skater who has represented his country at the highest levels of international competition, including the Olympic Winter Games 2022, where he achieved a best finish of 8th in the Men's 1500m. He made history by becoming the first Kazakh short track skater to podium in a World Cup 1500m event, securing second place in Beijing in 2021—a milestone achievement for Kazakh winter sports. His personal philosophy, \"I came, I saw, I won,\" reflects his determined mindset, shaped by early setbacks including serious foot injuries during training in 2012. Galiakhmetov, who hails from Oral and began skating there in 2010, cites national hero Abzal Azhgaliyev and global stars like Cristiano Ronaldo as inspirations, and he aims to win an Olympic medal in pursuit of his ultimate ambition. Beyond skating, he enjoys fishing, reading, and spending time with family, while holding the prestigious title of Master of Sport of International Class in Kazakhstan.",
    "59ae22e1-2772-412d-8714-8ac113571053": "Shaoang Liu is a competitive short track speed skater representing China, having previously competed for Hungary, where he was born in Budapest to a Chinese father and Hungarian mother. He achieved historic success at the Winter Olympics, winning gold in the 500m individual event at Beijing 2022 as well as being part of Hungary’s gold-medal-winning 5000m relay team at Pyeongchang 2018—Hungary’s first Winter Olympic gold—and earned a total of four Olympic medals, making him Hungary’s most decorated Winter Olympian. Since switching to represent China in mid-2023, he has remained competitive, securing podium finishes in the ISU World Tour events, including a third-place finish in the Men’s 1500m at the 2025 World Championships in Beijing. Unusually, Shaoang has a deeply intertwined athletic partnership with his older brother, Sándor Liu Shaolin, whom he trains and competes alongside, crediting him as both a mentor and primary motivator throughout his career. Standing at 181 cm and fluent in English, Hungarian, and Mandarin, Shaoang combines physical power inherited from his Hungarian roots with the speed associated with his Chinese heritage, embodying a unique cross-cultural identity in international sport.",
    "5dc025c0-4553-4107-b42f-a7a6794f8495": "Stijn Desmet is a Belgian short track speed skater who has established himself as one of Europe’s top competitors, achieving multiple podium finishes at World and European Championships. He represented Belgium at the 2022 Olympic Winter Games, finishing 14th in the 500m and 13th in the 1500m, while being disqualified in the 1000m due to a penalty. Desmet earned a silver medal in the 1500m at the 2025 World Championships and finished fourth in the 500m, highlighting his versatility across distances. He has also claimed several European Championship medals, including gold in the 1000m in 2023 and silver in the 1500m in both 2023 and 2025. Unusually, Desmet began skating to help manage his ADHD, and he continues to balance elite sport with pursuing a master's degree in industrial engineering at KU Leuven, emphasizing education as a priority alongside his athletic career.",
    "5f994194-cdf8-41f6-b03a-f7de5326b09a": "Huan-Chen Lai Tsai is a male short track speed skater representing Chinese Taipei (TPE) and currently active in international competition. Born on October 20, 2006, he has competed in multiple ISU Short Track World Tour events during the 2024–2025 season across distances including the 500 m, 1000 m, and 1500 m. His notable results include a 31st-place finish in the Men's 1500 m at the October 2025 event in Canada and previous placements between 53rd and 73rd in various events held in South Korea and Canada in late 2024. While he has not yet earned ranking points, his participation in elite global competitions highlights his development within the sport. Unusually, most personal details such as height, hometown, club, and hobbies are listed as \"N/A,\" leaving little public information about his background or training history.",
    "684d77eb-e2b4-4b0f-b5aa-7a32a1cc99ac": "Peter Murphy is a Luxembourgish short track speed skater who has represented his country at multiple ISU World and European Championships, achieving notable results such as 31st in the 1000m at the 2021 World Championships. He began skating in 2010 in Kockelscheuer, Luxembourg, inspired by watching his sister compete, and has since become a prominent figure in Luxembourgish winter sports, winning gold and silver medals at the 2017 European Youth Olympic Winter Festival. Standing at 182 cm and hailing from Heerenveen, Murphy balances his athletic career with being a student and has overcome significant challenges, including back surgery that caused him to miss the entire 2021/22 season. Fluent in English, French, German, and Luxembourgish, he cites Russian skater Victor An and footballer Frank Lampard as his idols, and credits his parents and coach Gregory Durand as the most influential people in his career. Unusually for a winter sport athlete from a non-traditional skating nation, Murphy also served as a European Young Olympic Ambassador for the 2023 EYOF, showcasing his commitment to youth engagement in sport.",
    "694b1f62-3ad8-4d0d-bcde-31fe41f01f8c": "Thomas Nadalini is an active Italian short track speed skater who has competed in multiple ISU World Cups, European Championships, and World Championships since 2020. He achieved a notable fourth-place finish in the Men's 1500 m at the 2025 European Championships and placed fifth in the 500 m at the 2025 ISU Short Track World Tour in Canada, marking some of his strongest results to date. Early in his career, he represented Italy at the 2020 World Junior Championships, where he posted top-15 finishes in the 500 m and 1000 m events. Unusually, Nadalini began his athletic journey in ice hockey before switching to short track after following his brother into the sport, and he now balances his training as a police athlete. He also has a unique pre-race ritual of putting on his right skate before his left and goes by the nickname \"Nada,\" while enjoying video games, movies, and music in his spare time.",
    "6966756c-063a-4dad-8481-de3a5060fba8": "Rostyslav Leontenko is a Ukrainian short track speed skater who has been competing actively since at least 2023. He represented Ukraine at several major international events, including the ISU World Junior Championships, European Championships, and multiple ISU World Cup and World Tour competitions, achieving his best result with a 29th place in the Men's 500 m at the 2024 World Junior Championships. His performances have primarily come in the 500 m and 1000 m distances, with consistent participation in the 2023–2025 seasons across Canada, Europe, and Asia. Notably, he placed 32nd in the 500 m at the 2025 European Championships and achieved a top-40 finish in several World Tour events, showing gradual development on the world stage. Unusually, very little personal information is available about him—details such as height, hometown, club, and hobbies are all listed as \"N/A\", making his background largely unknown despite his active competition status.",
    "69ff363e-e62c-408d-934a-8315964a100d": "Brandon Yan Kai Pok is a Singaporean short track speed skater born on May 5, 2006, who began skating at the age of seven after being introduced to the sport during a demonstration at JCube shopping centre in Singapore. He represents Singapore in international competitions, including the ISU World Junior Championships and ISU World Cup events, with his best recorded result being a 32nd place in the Men's 1500m at the 2024 World Cup in Poland. A student by profession, Pok trains with the Snow Leopard Speed Skating Club and has cited Korean skater Lee June-Seo as his idol, while crediting coach Chun Lee-Kyung as the most influential person in his career. Among his personal achievements, he highlights finishing fifth in the A final of the boys' 1500m at the 2019 Asian Open Trophy in Kunming. Unusually for a winter sport athlete from Southeast Asia, Pok developed his passion through a local mall rink, and outside skating, he enjoys K-pop, Korean dramas, sci-fi literature, and spending time in nature.",
    "6ee4046c-f05f-4895-b0fe-77c5dc78f644": "Munkh-Erdene Erdenebileg is a Mongolian short track speed skater who has competed in multiple international events, including the ISU World Championships and World Junior Championships. He represented Mongolia at the 2024 and 2025 World Championships, achieving his best result with a 31st place in the Men's 1500 m in 2025. His performances in recent ISU World Tour events have seen him rank between 66th and 86th across various distances, showing gradual development on the global stage. Notably, detailed personal information such as his height, hometown, and skating club are not publicly available, making his background less documented compared to other elite skaters. As an active competitor born in 2004, he continues to gain experience against top-level competition in a sport traditionally dominated by East Asian and European nations.",
    "7241404a-ad95-48e4-828b-a639b7b2cf9f": "Muhammed BOZDAG is a Turkish short track speed skater born on June 17, 2007, who has been competing actively in international events since at least 2023. He achieved notable success at the 2024 Winter Youth Olympic Games, where he won a silver medal in the Men's 1000m event, highlighting his potential as a rising talent. His performances in the ISU World Tour and World Cup competitions show steady progress, with a standout 6th place finish in the Men's 1500 m during the November 2024 leg in Canada. BOZDAG has also represented Turkey at the European Championships and World Junior Championships, achieving best results of 11th in the 1000 m at the 2025 European Championships and 19th in the 1500 m at the 2025 World Juniors. Unusually, despite his active status and participation in major events, several personal details such as his height, hometown, club, and hobbies remain unlisted in official records.",
    "7b9d12ae-44ce-4fb8-8e3e-b2bb8ee3c63c": "Nico Andermann is an Austrian short track speed skater who has been competing internationally since 2015, representing Austria in multiple World and European Championships. He achieved his best individual result at the 2023 World Cup in Seoul, where he placed 8th in the Men's 1500m (1), and has consistently performed at a high level in European competitions, finishing 8th in the 1500m at the 2023 European Championships. Andermann, born on September 25, 1999, in Vienna, began skating in 2008 with ERC Wien and balances his athletic career as an Armed Forces Athlete. Notably, he once cited breaking his arm while skiing in 2013—leading to a six-month break from skating—as a significant setback in his career. He looks up to alpine skier Marcel Hirscher and credits his older brother Dominic as the most influential person in his sporting journey.",
    "803fa954-f0ae-4120-bf37-af6a795a1341": "Ryo Ong is a Singaporean short track speed skater born on 28 July 2006 in Singapore, who began skating at the age of eight through the Snow Leopard Speed Skating Club. He has represented Singapore at major international events including the 2024 Winter Youth Olympic Games, where he achieved a notable 13th place in the Men's 1500m, and multiple ISU World Cups and World Championships, with his best individual result being 21st in the 1500m at the 2024 World Cup. Despite competing against older and more experienced athletes, Ong continues to improve, as seen in his progression from junior to senior levels, including appearances at the Four Continents Championships and World Junior Championships. Unusually for an athlete from a tropical nation, Ong has carved out a competitive career in winter sports, driven by his passion for anime and inspired by Korean skater Park Ji-Won, while affectionately embracing the nickname \"Snory\" due to his love for Snorlax from Pokémon. His sporting philosophy of \"never give up,\" rooted in support from his mother, fuels his ambition to one day compete at the Olympic Winter Games.",
    "843abd46-cc28-4728-be4c-a887965aa21d": "Abzal Azhgaliyev is a Kazakh short track speed skater who has represented Kazakhstan at multiple Olympic Winter Games, achieving a career-best fourth-place finish in the Men's 500m at the 2022 Beijing Olympics. He made history by becoming the first Kazakh short track skater to win a World Cup gold medal, claiming victory in the 500m event in Salt Lake City in 2016. Over his career, he has consistently competed at the highest level, with numerous top-10 finishes in World Cup events and participation in four consecutive Winter Olympics (2014–2022). Unusually, Azhgaliyev holds a pre-competition dinner for close friends and family to wish him luck, a personal ritual he maintains before major events. A Master of Sport of International Class, he cites his mother as the most influential person in his career and draws inspiration from boxing legend Muhammad Ali.",
    "86308f5c-9f44-4b71-89bc-ff577fcd76a0": "Ivan Martinic is a Croatian short track speed skater who has been competing internationally since 2015, representing Croatia at multiple ISU World and European Championships. He achieved his best individual result at the 2019 World Cup in Turin, where he placed 13th in the 500m, a performance he personally highlights as a key achievement. Martinic has consistently competed across all distances—500m, 1000m, and 1500m—at major events, with his highest World Championship finish being 38th in the 500m (2023) and notable placements in European Championships, including 18th in the 500m in 2020. Unusually for a winter sport athlete from Croatia, Martinic cites American professional wrestler John Cena as his idol, and he is fluent in five languages: Croatian, Bosnian, Montenegrin, Bulgarian, and English. He began skating in 2007 in Zagreb, overcoming significant injuries including a broken leg in 2012 and a knee injury in 2021, demonstrating resilience throughout his career.",
    "89ebc323-0aef-4373-bc5c-6694f0b76935": "Denis Nikisha is a Kazakh short track speed skater who has represented Kazakhstan at multiple Olympic Games, achieving his best individual result with an 8th-place finish in the 500m at the 2022 Winter Olympics. He has consistently performed at the highest level in World Championships, earning silver medals in the Men's 500m in both 2024 and 2025, and securing fourth place in the same event in 2023. Known for his specialization in the 500m distance, Nikisha has also achieved podium finishes in ISU World Cup events, including winning gold in Minsk in 2017 and multiple second-place finishes in recent seasons. Unusually, despite competing at the elite international level for over a decade, he has never advanced to an Olympic final beyond the 2022 500m appearance, and his career includes several penalty disqualifications across major competitions. Born in Kustanai and raised in Kokshetau, Nikisha was drawn to short track by its unpredictability and danger, and he remains motivated by the ambition of winning Olympic gold, supported by his philosophy of overcoming the opponent, oneself, and the judge to achieve victory.",
    "8c4b0fed-35c0-4465-8de1-146367c4af73": "Ivan Donchev is a Bulgarian short track speed skater born on December 8, 2005, in Sofia, where he began skating at the age of five. He has represented Bulgaria in numerous international competitions, including the ISU World Championships, European Championships, and World Cup events, achieving notable results such as 17th place in the 1500 m at the 2024 European Championships and reaching the A final in the 1500 m at the 2022 European Youth Olympic Winter Festival. Donchev competes actively on the ISU Short Track World Tour and has shown consistent participation across all distances—500 m, 1000 m, and 1500 m—though he has yet to secure a podium finish at senior global championships. Unusually for a winter sport athlete from Bulgaria, he speaks five languages (Bulgarian, English, German, Portuguese, and Spanish) and cites Russian legend Victor An as his idol, while crediting coach Evgenia Radanova as the most influential person in his career. Despite breaking his leg during his athletic development, Donchev continues to compete with the motto: \"Take the risk or lose the chance. Strive to be the best.\"",
    "8d006479-00dc-4baa-82af-354a2f3f26b3": "Reinis Berzins is a Latvian short track speed skater who has represented his country at the highest levels of international competition, including the Olympic Winter Games and multiple World Championships. He achieved his best result at the 2021 World Championships by reaching the 1500m A final and finishing eighth, showcasing his strength in longer distances. Berzins has also earned notable results at the European level, winning bronze in the 500m at the 2023 European Championships and placing fourth in the same event in 2025. Born in Riga and raised in Ozolnieki, he began skating in 2010 after initially aiming for ice hockey but was introduced to short track by coach Evita Krievane, who became the most influential person in his career. Unusually dedicated to mental preparation, Berzins follows a strict pre-competition routine that includes going to sleep one hour earlier than usual and using breathing exercises to manage stress and enhance focus before races.",
    "996efec1-974c-4d9d-8e24-17babe3ddf17": "Lorenzo Previtali is an Italian short track speed skater born on July 18, 2005, who competes internationally as an active athlete. He has represented Italy at multiple ISU World Junior Short Track Speed Skating Championships, achieving a notable silver medal in the Men's 1500 m event in 2024. Previtali has also participated in senior competitions, including the ISU European Championships and the ISU Short Track World Tour, with a best result of 8th place in the 1000 m during the 2024 World Tour stop in South Korea. His performances show steady improvement across various distances, though detailed personal information such as height, hometown, or skating club remains unavailable. An unusual aspect of his competition record is the duplication of some results entries under slightly different event names, which may reflect data logging inconsistencies rather than actual duplicate races.",
    "9cdf9c33-93b3-4bd7-a4d0-fb00ba6ebcd3": "Pietro Sighel is an Italian short track speed skater who has established himself as one of Europe’s top competitors, winning multiple medals at World and European Championships. He claimed bronze in the 500m at the 2022 Winter Olympics in Beijing and earned silver medals in both the 1000m and 1500m at the 2023 World Championships, along with a gold in the 500m that same year. Sighel dominated the European scene, achieving a historic triple gold in the 500m, 1000m, and 1500m at the 2024 European Championships, and winning gold again in the 1000m in 2025. Unusually for a winter athlete, he is a police athlete by profession and trains twice daily, six days a week, while citing his father as the most influential person in his career. He began skating at age four on a frozen lake in his hometown of Baselga di Piné and overcame a serious compound ankle fracture in 2017 to reach the pinnacle of his sport, driven by the ambition of winning an Olympic gold medal.",
    "a069c448-0fa1-471c-b30b-4f87ba4fa44d": "Warre Van Damme is a Belgian short track speed skater born on 14 January 2003, who has been competing internationally since his junior career began in 2013 with Shorttrackclub Kristallijn Gent. He represented Belgium at multiple ISU World Junior Championships between 2019 and 2022, achieving his best result with a 14th place in the Men’s 1500 m in 2022. Van Damme has also competed in numerous ISU World Cup and ISU World Tour events from 2022 to 2025, regularly participating in distances of 500 m, 1000 m, and 1500 m, with notable appearances at the 2024 European Championships where he placed 28th in the 1500 m. Unusually, he has also represented Belgium in roller speed skating at junior international levels, showcasing his versatility across skating disciplines. Balancing his athletic career with studies, Van Damme aims to compete at the Olympic Winter Games, as stated in his public ambitions.",
    "a15aaec4-779d-4ca4-916a-6589b7678c2f": "Shogo Miyata, representing Japan, is an active short track speed skater who has competed at the highest levels of the sport, including the 2022 Olympic Winter Games where he placed 23rd in the Men's 1000m and 27th in the 1500m. He achieved a notable 9th-place finish in the 500m at the 2025 World Championships and has consistently performed well in the ISU World Tour, with top-five finishes in multiple 500m and 1500m events during the 2024–2025 season. Early in his career, Miyata showed promise by finishing fourth in the 1500m at the 2019 World Junior Championships and earning the Osaka Sports Award that same year. A serious setback came in November 2023 when he fractured his left ankle at the Four Continents Championships, but he returned to competition shortly after. Miyata, who began skating at age six in Osaka and cites Japanese Olympian Takafumi Nishitani as both his idol and most influential figure, remains driven by his ambition to win Olympic gold.",
    "a9d7de7a-d561-43e7-9d2b-a25f5b720ea8": "Lukasz Kuczynski is a Polish short track speed skater who has represented Poland in numerous international competitions, including the ISU World and European Championships. He achieved notable success by winning a bronze medal in the 5000m relay at the 2023 European Championships, marking the first time Polish male short trackers earned a medal at this event. Kuczynski has consistently performed well in the 500m distance, reaching the top 10 at both the 2023 World Championships and multiple ISU World Cup events, with several third-place finishes in World Cup races. Unusually, he serves as an Armed Forces athlete and trains rigorously—23 to 26 hours per week—while also coping with past injuries, including two leg fractures in 2014 that sidelined him for six months. Outside of skating, Kuczynski enjoys mixed martial arts, video games, and draws inspiration from his family, coach Dariusz Kulesza, and Apolo Anton Ohno, skating to music before competitions as part of his mental preparation.",
    "abe82db9-af4f-44cc-a51a-04967c7e4a5c": "Miika Klevstuen is a Norwegian short track speed skater born on September 5, 2006, who competes internationally as an active athlete. He has represented Norway at major events including the ISU World Junior Short Track Speed Skating Championships, where he achieved a notable 4th place in the Men's 1500 m in 2025, and the ISU European Championships, with top-30 finishes across multiple distances in 2025. Klevstuen has also participated in the ISU Short Track World Tour, achieving his best result with a 30th-place finish in the 500 m and 1500 m during the 2024–2025 season. At the 2025 World Championships in Beijing, he placed 41st in the 1500 m, marking his presence on the senior global stage. Unusually, despite his competitive activity, very little personal information is publicly available, including details about his height, hometown, club, or hobbies.",
    "aec5d4c4-5b9a-49a6-9803-d76affd5bdae": "Jonathan Moody is a British short track speed skater who has represented Great Britain in multiple ISU World Cups, European Championships, and World Junior Championships since his junior career began. He achieved a notable 10th place in the 1500m at the 2018 World Junior Championships, reaching the B final and setting a junior British record in the process. Competing consistently on the international stage, Moody placed 23rd in the 1000m at the 2025 European Championships and has recorded mid-tier finishes in various World Cup and World Tour events between 2021 and 2025. Born on August 23, 1998, in Nottingham, he began skating at age 12 in Auckland, New Zealand, and later trained in the United States before returning to England in 2013. Unusually, Moody overcame a severe leg injury in 2015—breaking it in three places—which sidelined him for nine months, and he cites his parents as the most influential figures in his career, while drawing inspiration from swimmer Michael Phelps.",
    "af470988-b4c5-4d6a-b176-82176f4743e7": "Jiwon PARK, a South Korean short track speed skater born on 23 September 1996 in Gangneung, has established himself as one of the top competitors in the sport, achieving significant success at both World Championships and World Cup events. He won gold in the Men's 1500 m at the 2023 World Championships and claimed multiple Four Continents titles, including winning all three individual distances (500 m, 1000 m, and 1500 m) in 2022 and 2023. PARK also earned the prestigious Crystal Globe for the 2022/23 World Cup season, highlighting his consistency and dominance across the circuit. Unusually, despite being an elite athlete, he is passionate about video production and photography, often sharing creative content on his Instagram, and he cites a former American skater, John Celski, as his idol—rare inspiration from outside the dominant Asian short track powers. Notably, he began skating during school holidays and was recruited by a coach after showing promise, overcoming two ankle fractures early in his development to pursue his Olympic ambition.",
    "af71dca0-c9fb-4f77-be3a-8ff047e99c39": "Oleh Handei is a Ukrainian short track speed skater born on March 5, 1999, in Kyiv, where he began skating in 2009 after previously practicing figure skating. Representing Ukraine as a member of the Armed Forces, he has competed in multiple World and European Championships, achieving notable results such as 8th place in the 500m at the 2024 European Championships and reaching the top 15 in several World Cup events. Although he placed 27th in the 500m at the 2022 Winter Olympics, one of his personal highlights was finishing 10th in that same event at the 2022 World Championships. Handei, who stands 165 cm tall, holds the title of Master of Sport in Ukraine and speaks English, Polish, and Ukrainian. Unusually passionate about reading and cycling, he lives by the motto: \"One moment of pain is worth a lifetime of glory.\"",
    "b04d2e6d-b92c-4548-ac22-e5930ca27da4": "Michal Niewinski is a Polish short track speed skater who has emerged as a prominent figure in international competition, achieving notable success at both junior and senior levels. He made history by becoming the first Polish short track skater to win gold at the World Junior Championships, claiming victory in the men's 500m event at the 2023 tournament in Dresden, Germany. Niewinski also contributed to another milestone for Polish short track, earning a bronze medal in the 5000m relay at the 2023 European Championships—the first time Polish men secured a relay medal at that level. Competing consistently on the ISU World Tour and World Cup circuits, he achieved a career-best eighth-place finish in the 1000m at the 2024 World Championships and placed fifth in two individual events at the 2025 European Championships. Unusually, Niewinski balances his elite athletic career with service as an armed forces athlete and works as a coach, while citing fellow Pole Patrycja Maliszewska as his idol in the sport.",
    "b175d978-795a-464a-b6ba-68e8d3edec0a": "Jonas Hammermüller is a German short track speed skater who has represented his country in multiple international competitions, including the ISU World Cup and European Championships. He made his mark as a junior athlete by competing at the 2019 European Youth Olympic Winter Festival and participating in two World Junior Championships, with his best result being 24th place in the 1500 m in 2022. On the senior circuit, he achieved a notable 16th-place finish in the 500 m at the 2024 ISU World Cup and competed in the 2025 European Championships, placing 26th in the 1500 m. Unusually, Hammermüller began skating after an aptitude test recommended the sport, and despite dealing with persistent knee pain since 2018 and a broken foot in 2022, he continues to pursue his ambition of winning an Olympic medal. Based in Dresden, where he also started skating at age eight, he balances his athletic career with studying, enjoys cooking, and cites his parents as the most influential figures in his journey.",
    "b510697a-fcd6-4c6b-9740-3cc6dbf57105": "Lucas Henry Koo is a Brazilian short track speed skater of Korean descent, born on November 20, 2006, in Rochester, NY, and raised in Philadelphia. He represents Brazil internationally despite being based in the United States, where he began skating at age four with the Potomac Speedskating Club. Koo achieved notable results at the 2024 Winter Youth Olympic Games, finishing 10th in the 500m, 9th in the 1000m, and 21st in the 1500m, marking him as one of Brazil’s top prospects in winter sports. Unusually, he has strong cultural ties to both the U.S. and Korea—he speaks English and Korean, goes by the nickname \"Luca,\" and cites South Korean skater Hwang Dae-Heon as his idol—while competing under the Brazilian flag. A dedicated student and gamer, Koo follows a personal ritual of putting on his right skate before his left and aims to compete at the 2026 Winter Olympics, driven by the support of his mother, whom he credits as the most influential person in his career.",
    "b970ce3d-6bfd-4007-a836-19d13fca9c9d": "Zdeněk Sejpal is a Czech short track speed skater born on April 26, 2001, in Benátky nad Jizerou, where he also began his skating career with the local club KSB Benatky nad Jizerou. Competing internationally since at least 2018, Sejpal has represented the Czech Republic at multiple ISU World and European Championships, achieving notable results such as 13th place in the 1500 m at the 2021 European Championships and several top-30 finishes in World Cup events, including an 11th place in the 1000 m in China during the 2023 season. He has consistently competed across all distances—500 m, 1000 m, and 1500 m—at major events like the World Junior Championships (first appearing in 2018) and senior-level competitions, though he has not yet reached a final at the World Championships. In addition to ice skating, Sejpal has represented the Czech Republic in roller speed skating and participated in the road marathon event at the 2018 Roller Speed Skating World Championships in Arnhem. Fluent in Czech and English, he is affectionately known by the nicknames \"Zdenda\" and \"Sejpy,\" and remains an active competitor, with recent appearances in the 2024–2025 ISU Short Track World Tour.",
    "bd75d3d0-bab6-4daa-90ea-0f246ac1dd2f": "Tobias WOLF, from Weiz, Austria, is an active short track speed skater representing Austria in international competitions. Born on November 7, 2004, in Feldbach, he began skating around age six, inspired by his siblings, and has since competed in events such as the ISU World Championships, European Championships, and multiple World Cups and World Tours. His best result at a senior World Championship came in 2024 when he placed 12th in the Men's 1500 m, while also achieving a top-30 finish in the same distance at the 2025 European Championships. Notably, WOLF has also competed in speed skating and roller speed skating at the Austrian national level, showcasing his versatility across disciplines. Outside of skating, he enjoys hiking, baking, and playing video games, and looks up to athletes like Hermann Maier and Brendan Corey, with aspirations to compete at the 2026 Winter Olympics in Milan-Cortina.",
    "c4b9df64-f59a-4f18-b837-0de23875f136": "Jordan Pierre-Gilles is a Canadian short track speed skater who competes internationally for Canada and has established himself as a top contender in the 500m and 1000m events. He won an Olympic gold medal as part of Canada’s 5000m relay team at the 2022 Winter Games in Beijing, marking the pinnacle of his career so far, despite finishing 18th and 16th in the individual 500m and 1000m events that year. His most notable individual success came with a bronze medal in the 500m at the 2024 World Championships, along with multiple podium finishes on the ISU World Cup and World Tour circuits, including victories in China and Canada during the 2023–24 season. Born in Sherbrooke and raised in Montreal, he began skating at age eight by following his brother into the sport and now trains at the Maurice Richard Arena, balancing his athletic career with studies. Unusually, despite several injuries—including a significant ankle sprain in 2022 and a back injury in 2016—that disrupted his momentum, Pierre-Gilles has maintained a calm, fun-first philosophy, citing icons like Kobe Bryant and Victor An as inspirations while aiming for world championship gold.",
    "c7b3a7a6-7d73-4870-81c0-983009b1a7df": "Westley Yates, born on 21 February 2000 in Guelph, Canada, is a British short track speed skater who represents Great Britain internationally despite being born and initially trained in Canada. He began skating in 2007 in Ontario and later moved to Nottingham, England, in 2018 for training, where he decided to stay and compete for Great Britain due to his British citizenship. Yates has competed in multiple ISU World Cup and World Tour events, achieving notable placements such as 32nd in the Men's 1000 m at the 2024 South Korea World Tour and participating in the 2019 World Junior Championships in Montreal. Balancing athletics with academics, he studies economics at the University of Nottingham and identifies his parents as the most influential figures in his career, skating under the personal motto \"Never give up.\" Unusually, Yates made a transatlantic transition mid-career—from the Canadian development system to becoming part of Britain’s Olympic pathway—highlighting his dedication to chasing his dream of competing at the Winter Olympics.",
    "c7c8d6cd-9ad1-4028-8411-a2d2f121c8be": "Sean McAnuff is an active short track speed skater representing Ireland, where he competes internationally despite being born in Oakville, Canada, and residing in Budapest, Hungary. He has participated in multiple ISU World Championships, European Championships, and World Cup events, achieving notable results such as a 16th-place finish in the 500 m at the 2025 ISU Short Track World Tour in the Netherlands and consistent mid-tier rankings across various distances. A dual citizen of Canada and Ireland, McAnuff chose to represent Ireland to help grow the sport there, inspired by his family heritage and a desire to build something new rather than compete within Canada’s already elite program. Beyond skating, he is a business owner who co-founded Elite Performance Training with his brother Ryan, and he enjoys hobbies like pottery, walking his dog Maple, and making coffee—reflecting his long-term ambition to one day own a coffee shop. Standing at 185 cm and fluent in English and French, McAnuff also draws motivation from his sporting philosophy—\"Pray hard, play hard, stay humble\"—and cites Dwayne 'The Rock' Johnson as his idol, while crediting his brother Ryan as the most influential person in his career.",
    "d0aa76b3-ea67-499e-84fb-50b0420310e6": "Lukas MACDONALD, representing New Zealand, is an active short track speed skater who began his skating journey in Vancouver, Canada, before transitioning to represent his birthplace nation of New Zealand. Born on August 10, 2001, in Santa Rosa, California, and raised in Auckland, he started speed skating in eighth grade as cross-training for ice hockey and figure skating, eventually committing fully to the sport. His competitive results include top-25 finishes at the Four Continents Championships, with a best of 12th in the 500m in 2022, and participation in multiple ISU World Cups and World Championships, where he placed 32nd in the 1500m at the 2024 World Championships. Notably, despite being a New Zealand athlete, MacDonald previously competed for Canada at youth levels, including representing British Columbia at the 2019 Canada Winter Games. He is affectionately nicknamed \"Lucky\" and cites Japanese skater Keita Watanabe as his idol in the sport.",
    "d39dfaf3-6fb7-43e7-ae32-cddce46b22e4": "Warre Noiron is a Belgian short track speed skater born on January 5, 2005, who is currently active in international competition. He has represented Belgium at events such as the ISU World Junior Championships, European Championships, and multiple ISU Short Track World Tour stops between 2023 and 2025. His best recorded result is a 31st place in the Men's 1000 m at the 2024 World Tour event in Canada, with several other finishes in the 30s and 40s across various distances. While he competed in the 2025 World Championships, he placed 50th in the 1500 m and has not yet advanced to medal contention at senior global events. Notably, detailed personal information such as his height, hometown, club, and hobbies is not publicly available, making him a relatively private figure in the sport.",
    "d3f94799-45ef-483d-98a4-ca33cfbd22d1": "Phooripat Changmai is a Thai short track speed skater born on February 21, 2007, representing Thailand in international competitions. He has participated in multiple ISU Short Track World Tour events during the 2024–2025 season, competing in the 500 m, 1000 m, and 1500 m distances across locations such as South Korea, China, Canada, and Italy. His notable results include a 54th-place finish in the Men's 1500 m at the 2024 World Tour event in China and consistent participation in all major distances throughout the season. While he has not yet recorded points or advanced to finals, his presence marks Thailand’s growing involvement in winter sports despite limited domestic infrastructure. Unusually, very little personal information is available about him, including height, hometown, or skating club, which is uncommon among elite-level athletes.",
    "db9e00f8-3eb5-458a-b8d1-21582b6838a9": "Niall Treacy is a British short track speed skater who has represented Great Britain at major international competitions, including the 2022 Olympic Winter Games in Beijing, where he finished 27th in the Men's 1000m. He has achieved notable results at the European Championships, securing 2nd place in the Men's 1000m in 2024 and 4th in the same event in 2025, highlighting his consistency in that distance. Treacy has also posted strong World Cup performances, including a 3rd-place finish in the Men's 1000m at the ISU Short Track World Tour in China in December 2024. Born in Solihull and raised in Nottingham, he began skating at age eight alongside his brothers, which inspired his entry into the sport, and he remains affiliated with the Mohawks Ice Racing Club. An interesting personal detail is his pre-race ritual of tightening his left skate before his right, and he cites tennis legend Roger Federer as his sporting idol while aspiring to win an Olympic medal at the 2026 Winter Games.",
    "dc16e0b5-a168-4cc2-84a8-26828fa2373c": "Robin Bendig is a German short track speed skater who has represented his country in multiple ISU World Cups, European Championships, and World Championships. He achieved his best individual result at the 2023 European Championships with a 13th place in the Men's 1500 m, and has consistently competed at a high level, including a 19th-place finish in the 1500 m at the 2024 World Cup in Dresden. Competing as an Armed Forces athlete, Bendig balances his sporting career with military service, highlighting his dedication and discipline. Born in Dresden in 2000, he started skating at age nine and cites the sport’s speed as what initially attracted him, while also enjoying windsurfing in his free time. Notably, he overcame hip impingement syndrome requiring surgery in 2020, returning to training just four months later, and remains driven by his ambition to compete at the Olympic Winter Games.",
    "dc80c9c3-094f-4762-a72d-5dc47a1b9d47": "Kosei Hayashi is a Japanese short track speed skater who has emerged as a promising talent on the international stage, achieving notable results in both junior and senior competitions. He placed fourth in the Men's 1500 m at the 2024 World Championships and earned a bronze medal in the 1000 m at a 2024 ISU World Cup event in Poland, highlighting his competitive strength. Earlier in his career, he finished fifth in the 1500 m at the 2023 World Junior Championships and secured fourth place in the same distance at the 2022 Four Continents Championships. Standing at just 160 cm tall and born on October 23, 2003, Hayashi began skating in primary school under the influence of his parents and later chose to specialize in short track during high school. An unusual personal detail about him is his fondness for drinking milk products, which he lists as one of his hobbies.",
    "e37b1fad-a1c9-4a79-94fe-15626c82d058": "Furkan Akar is a Turkish short track speed skater who made history by becoming the first athlete from Turkey to compete in short track at the Olympic Winter Games, finishing sixth in the 1000m at Beijing 2022. He further broke new ground by winning bronze in the 1000m at the 2023 European Championships, marking Turkey’s first medal in the sport at that level. Competing consistently on the ISU World Cup and World Tour circuits, Akar has achieved notable results including a fourth-place finish in the 1000m at the 2022 World Cup in Salt Lake City. Born in Erzurum, he began skating on makeshift ice with bags on his feet before receiving his first pair of skates from a coach, highlighting the humble beginnings that shaped his determined approach to the sport. A devout competitor, Akar prays before races and cites his brother Burak as the most influential figure in his career, while aiming for Olympic success at Milan-Cortina 2026 and a future as a short track coach.",
    "e8c2bb25-db3d-416c-a9d4-49f1721c7e1e": "Stefan-Alexander Kumurdjiev is a Bulgarian short track speed skater born on August 1, 2005, in Sofia, where he began skating at the age of five. He has represented Bulgaria in numerous international competitions, including the ISU World Cup, European Championships, and World Junior Championships, achieving notable results such as 24th place in the 500m at the 2023 World Juniors and competing in multiple events at the 2025 European Championships. His best-known achievements include reaching the B finals in both the 500m and 1500m at the 2022 European Youth Olympic Winter Festival in Vuokatti. Unusually, despite his young career, Kumurdjiev has already overcome a broken leg, demonstrating resilience, and he cites legendary skater Victor An as his idol while being coached by Bulgarian Olympic medalist Evgenia Radanova. Outside competition, he balances his athletic career with studies, enjoys cycling and spending time with friends, and goes by the nickname \"Kyumyuri\" within his family.",
    "ec754c8a-dada-4421-bb64-e64926e6b4c4": "Shaolin Liu is a Chinese short track speed skater born on November 20, 1995, in Budapest, Hungary, who has competed internationally since 2005 and began representing China in mid-2023. He achieved global recognition as part of Hungary’s historic 5000m relay team that won the nation’s first Winter Olympic gold medal at the 2018 Pyeongchang Games. Fluent in English, Hungarian, and Mandarin, Liu credits his success to early training stints in China with his brother Shaoang Liu, describing the rigorous program as transformative despite its physical and mental challenges. His career highlights include a seventh-place finish in the 1000m at the 2024 World Championships and multiple top-10 finishes in ISU World Cup events, including a second-place in the 500m in Canada in 2023. Unusually, Liu tested positive for COVID-19 twice in 2020, disrupting his training, and he remains vocal about resilience, citing his family and brother as central influences while embracing the motto: \"Never let haters get you down.\"",
    "f75b0c0f-107d-4474-bb47-45b2926ff298": "Steven Dubois is a Canadian short track speed skater who has established himself as one of the country's top athletes in the sport, winning Olympic medals and world championship titles. He captured bronze in the 500m and silver in the 1500m at the 2022 Beijing Winter Olympics, and later secured gold in the 500m at the 2025 World Championships in Beijing. Dubois has also earned multiple podium finishes at World Cup events and Four Continents Championships, showcasing his consistency across distances. An unusual aspect of his career was a significant loss of motivation during the pandemic, when training disruptions led him to take a mental break, calling it the \"roughest time\" of his athletic life. Born and raised in Terrebonne, Quebec, he began skating at age 11 after his parents steered him away from ice hockey, and now trains in Montreal while citing Russian skater Victor An as his idol.",
    "f7bdc857-3997-4abc-bfc9-80ee330f8563": "William Dandjinou, a Canadian short track speed skater from Montreal, has emerged as a top competitor on the international stage, winning gold in the 1500m at the 2024 World Championships and the 1000m at the 2025 World Championships, along with multiple World Tour victories in the 2024–2025 season. Standing at 191 cm, his height is unusually tall for a short tracker, but he turns it into an advantage by skating exceptionally low, maximizing his stride length and range of motion. He trains at the Maurice Richard Arena in Montreal and cites fellow Canadian Olympian Olivier Jean as both his idol and career mentor, crediting him with guiding his development. Dandjinou, who began skating at age six and made his World Cup debut in 2019, also won three gold and two silver medals at the 2019 Canada Winter Games and was named Quebec’s Male Short Track Athlete of the Year for 2019/20. Beyond skating, he enjoys cycling, basketball, reading, and playing chess, and is fluent in both English and French.",
    "ff9963a6-23ac-4c1d-ae21-1c5028264d69": "Jens Van 't Wout is a Dutch short track speed skater who has established himself as one of the top competitors in international racing, achieving podium finishes at multiple World Championships, including bronze medals in the 500m (2023, 2025) and silver in the 1500m (2024). He was part of the historic Dutch mixed 2000m relay team that won the first-ever world title in the event at the 2023 World Championships. Despite placing 19th in the 1000m and receiving a penalty in the 500m at the 2022 Winter Olympics, he has consistently performed well at European and World Cup levels, winning gold in all three individual distances at the 2025 European Championships. Born in the Netherlands but raised in Canada until age 12, Van 't Wout credits his brother Melle—also a competitive short tracker—for much of his development, training closely with him and even sharing hotel rooms and video analysis sessions. Uniquely, he once won a race at the 2020 International Invitation Cup but was disqualified for forgetting to wear his transponders, a self-described \"rookie mistake\" he still carries with humor."
  },
  "competition_personalized_summaries": {
    "NED": {
      "text": "The Netherlands had a solid showing in the Men's 500m at the ISU Short Track World Tour. Jens van 't Wout led the Dutch charge with a strong 6th-place finish, clocking 40.808 seconds. Itzhak de Laat followed closely in 7th with 41.041 seconds, while Teun Boer placed 13th in 41.436 seconds. All three athletes demonstrated consistent performances across heats and repechages, showcasing the depth of Dutch short track speed skating on the international stage.",
      "title": "NED Highlights"
    }
  },
  "race_personalized_summaries": {
    "012e0947-8230-483d-83f5-ad0b2cb77488": {
      "NED": {
        "text": "1. Martin KOLENC (41.583, +0.000)  \n2. Diane SELLIER (41.994, +0.411)  \n3. Radek FAJKUS (42.115, +0.532)  \n4. Stefan-Alexander KUMURDJIEV (42.479, +0.896)  \n5. Westley YATES (43.348, +1.765)  \n\nDiane Sellier led from the start, but Martin Kolenc surged ahead on the fourth lap and held the lead to win. The battle for second was tight, with Fajkus just edging Kumurdjiev. No falls or penalties—clean race, close times.",
        "title": "Rep. Quarterfinals · Heat 5 (NED)"
      }
    },
    "09813cb6-b619-4653-a2de-960aae7f6af1": {
      "NED": {
        "text": "1. Shaolin LIU (42.186)  \n2. Furkan AKAR (+0.096)  \n3. Warre NOIRON (+0.466)  \n4. Fredrik PEDERSEN (+0.624)  \n5. Robin BENDIG (+1.070)  \n\nLIU surged from second at the start, overtaking AKAR in lap 3 and holding the lead with strong cornering. AKAR led early but couldn't match LIU’s mid-race acceleration. The battle for third was tight, but NOIRON held off PEDERSEN. No falls or penalties—close racing until the final straight.",
        "title": "Rep. Quarterfinals · Heat 7 (NED)"
      }
    },
    "0e0b6e54-9153-42b7-93e9-e8db96a89a8b": {
      "NED": {
        "text": "1. Teun BOER (NED) – 41.672  \n2. Andrew HEO (USA) – 42.136 (+0.464)  \n3. Brendan COREY (AUS) – 42.472 (+0.800)  \n4. Adil GALIAKHMETOV (KAZ) – no time (fell on lap 3)  \n5. Reinis BERZINS (LAT) – PEN (caused interference)\n\nBOER started strong from lane 2, took the lead by lap 3 after HEO led early. Close battle between BOER and HEO in final laps, but Dutchman held off challenge. COREY steady in third. GALIAKHMETOV crashed mid-race, BERZINS penalized for obstruction. Tight race for gold spot, but BOER controlled the end.",
        "title": "Heats · Heat 6 (NED)"
      }
    },
    "10afd586-a194-42c6-9ba6-66740ef04f95": {
      "NED": {
        "text": "1. William DANDJINOU (40.741) – surged from second to first on lap 4, held off Kim with strong finish  \n2. Tae Sung KIM (41.016, +0.275) – led early, couldn't match Dandjinou’s final laps  \n3. Martin KOLENC (41.494, +0.753) – steady climb from fifth, gained positions late  \n4. Peter JASZAPATI (41.622, +0.881) – consistent pace, finished fourth  \n5. Janghyuk PARK – fell on final lap, recorded no time  \n6. Jiwon PARK – received yellow card, disqualified for illegal lane change causing contact  \n\nRace was tight early with Kim leading through three laps. Dandjinou overtook him in the back stretch of lap 4 and powered home. The Korean clash on the last corner caused a fall and penalty.",
        "title": "Quarterfinals · Heat 4 (NED)"
      }
    },
    "18e0d66c-9543-47d5-9d2d-9d53132ae31d": {
      "NED": {
        "text": "1. Nico ANDERMANN (43.047) – led from start to finish with strong opening lap  \n2. Maxim MAXIMOV (43.201, +0.154) – steady second, closed gap late  \n3. Joshua KAHL (43.456, +0.409) – held third most of race  \n4. Mark CSIZMADIA – fell on lap 3, recorded \"no time\"  \nA clean start saw Andermann take immediate control. Maximov and Kahl maintained positions throughout until Csizmadia crashed out mid-race. Gap stayed tight between top three until final straight, but no overtakes occurred. Andermann qualifies comfortably.",
        "title": "Preliminaries · Heat 11 (NED)"
      }
    },
    "1f992add-396d-4b0f-ab0d-17decd7e5956": {
      "NED": {
        "text": "1. Brendan COREY (42.098, +0.000)  \n2. Adil GALIAKHMETOV (42.341, +0.243)  \n3. Ivan MARTINIC (42.808, +0.710)  \n4. Jonathan MOODY (43.011, +0.913)  \n5. Liam O BRIEN (43.160, +1.062)  \n\nCOREY surged from second position at start to take the lead by lap 2 and held it cleanly. GALIAKHMETOV made steady gains from fifth, overtaking MOODY early and closing hard on COREY but fell short. MOODY led after lap 1 but faded in later laps. No falls or penalties—tight racing throughout with positions stabilizing mid-race.",
        "title": "Rep. Quarterfinals · Heat 6 (NED)"
      }
    },
    "2449ef8c-2c11-4893-9f8f-ae0c63291495": {
      "NED": {
        "text": "1. Jens VAN 'T WOUT (41.110)  \n2. Itzhak DE LAAT (+0.294)  \n3. Tae Sung KIM (+0.321)  \nShaoang LIU did not start.\n\nVAN 'T WOUT took the lead from the start and controlled the race, leading every lap. DE LAAT and KIM battled closely behind, swapping positions early but remained within 0.2 seconds of each other. No falls or penalties—clean race with the Dutch skater dominating. Final order settled by second lap and held to the finish.",
        "title": "Finals · Final B (NED)"
      }
    },
    "3b236f9b-4609-4021-8a3e-becb0deddb15": {
      "NED": {
        "text": "1. Roberts KRUZBERGS (40.856) – surged from 4th, overtaking on final laps  \n2. Jordan PIERRE-GILLES (41.210, +0.354) – led early, edged at the end  \n3. Tae Sung KIM (41.226, +0.370) – steady climb to bronze  \n4. Shogo MIYATA – fell after Lap 3 while leading, completed but no time  \nWilliam DANDJINOU disqualified (PEN) – caused interference early  \nRace saw dramatic lead change: MIYATA crashed out after dominating first half  \nKRUZBERGS powered through in last two laps to win  \nTop two advance to A Final, KIM to B Final",
        "title": "Semifinals · Heat 2 (NED)"
      }
    },
    "4841c03d-0409-47e4-ba40-0451b0624192": {
      "NED": {
        "text": "1. Furkan AKAR (42.589) – led from start to finish with consistent laps.  \n2. Brendan COREY (42.603, +0.014) – stayed close throughout, nearly catching Akar in the final stretch.  \n3. Yaroslav MOROZOV (42.840, +0.251) – steady pace, maintained third after a small gap opened mid-race.  \n4. Ryo ONG (44.526) – fell behind early, couldn't match the front three’s speed.  \n5. Phooripat CHANGMAI (44.585) – slow start, finished last without challenge.  \nRace was tight between 1st and 2nd until the end, but no overtakes or falls. Akar controlled the lead cleanly.",
        "title": "Preliminaries · Heat 5 (NED)"
      }
    },
    "4b48e988-a6df-4bed-8168-8e027e1c2d8f": {
      "NED": {
        "text": "1. Martin KOLENC (42.394) – led from start to finish with strong early lap  \n2. Lukas MACDONALD (42.491, +0.097) – stayed close, nearly caught leader in final stretch  \n3. Yui MATSUBAYASHI (42.897, +0.503) – steady pace, secured third after Zdenek’s fall  \n4. Adam GRANASZTOI (43.432, +1.038) – fourth throughout, couldn’t challenge podium  \n5. Zdenek SEJPAL – fell on second lap, no time recorded  \n\nRace decided early: KOLENC bolted ahead in first turn and never looked back. SEJPAL crashed hard rounding lap 2, causing a brief disruption but no stoppage. Top three pulled away cleanly, with MACDONALD nearly closing the gap. Tight battle for minor ranks, but no overtakes after the fall.",
        "title": "Preliminaries · Heat 9 (NED)"
      }
    },
    "4b767742-7b21-45bf-9bc7-dac58bf37958": {
      "NED": {
        "text": "1. Lucas WAREHAM (42.531)  \n2. Westley YATES (+0.184)  \n3. Chonlachart TAPROM (+0.585)  \n4. Marcus HOWARD (no time, ADV due to incident)  \n5. Murat TAHTACI (PEN)\n\nWareham started strong from lane 2, took the lead by lap 4 after Howard led early. Howard fell on lap 4, did not finish. Tahtaci penalized for interference. Wareham pulled away in final laps, but Yates closed hard for second. Tight race for top two until the end.",
        "title": "Preliminaries · Heat 3 (NED)"
      }
    },
    "701a6468-fb42-45e2-b504-94745b186277": {
      "NED": {
        "text": "1. Zhanshuo LOU (42.520, +0.000)  \n2. Muhammed BOZDAG (+0.069)  \n3. Kosei HAYASHI (+1.033)  \n4. Niall TREACY (+1.046, ADV)  \n5. Yanghun Ben JUNG (PEN)  \n\nLOU started fifth but surged late, overtaking the leaders in the final lap. TREACY led from start until lap 4, but faded on the last lap. BOZDAG held strong in second, while HAYASHI edged out TREACY for third. JUNG received a penalty, likely for lane infringement or contact. The top three battled closely, with LOU winning by just 0.069 seconds.",
        "title": "Rep. Quarterfinals · Heat 4 (NED)"
      }
    },
    "71c5b8c3-7f2b-4c52-b3a6-77206b1dfbfe": {
      "NED": {
        "text": "1. Steven DUBOIS (40.745) – led from start to finish with consistent laps.  \n2. Brandon KIM (+0.152) – stayed close throughout, second place secured early.  \n3. Thomas NADALINI (+0.429) – overtook Diane Sellier in final stretch after gradual climb.  \n4. Diane SELLIER (+0.593) – strong start but faded slightly in last lap.  \n5. Peter JASZAPATI (+2.062) – started slow, finished well behind.  \n\nRace was controlled by Dubois; no falls or penalties. Top two advanced directly (Q), Nadalini qualified as fastest loser (q).",
        "title": "Heats · Heat 1 (NED)"
      }
    },
    "7a104a86-1dc0-4b89-8b54-dbd03770017e": {
      "NED": {
        "text": "1. Steven DUBOIS (40.799) – led from start to finish with consistent laps.  \n2. Brandon KIM (+0.023) – stayed close throughout, nearly catching Dubois in the final stretch.  \n3. Itzhak DE LAAT (+0.242) – started fifth but climbed to third after a strong inside pass on lap 4.  \n4. Denis NIKISHA (1:11.203) – slowed dramatically after lap 3, likely due to a fall or injury.  \n5. Oleh HANDEI – penalized, did not finish.  \n\nRace was tight between first and second, with Dubois just edging Kim at the line. No major contact, but Handei’s penalty left the field short.",
        "title": "Quarterfinals · Heat 1 (NED)"
      }
    },
    "88de5ae5-289e-4340-a9b4-4190065dfcc2": {
      "NED": {
        "text": "1. Shaolin LIU (42.857) – led from start to finish, strong opening lap set the tone.  \n2. Ivan MARTINIC (+0.131) – started 3rd, steadily moved up, closed gap late.  \n3. Huan-Chen LAI TSAI (+0.512) – consistent pace, held off Bozdağ.  \n4. Muhammed BOZDAG – fell on lap 3, continued but out of contention.  \nIvan DONCHEV disqualified for a penalty (PEN), no time recorded.  \nLIU dominated early, but Martinic’s late charge made it close for second. No overtakes for the lead. ADV given to Bozdag due to fall.",
        "title": "Preliminaries · Heat 6 (NED)"
      }
    },
    "8c81587f-f245-4234-bfb9-46911bafaab7": {
      "NED": {
        "text": "1. Michal NIEWINSKI (41.274)  \n2. Shaolin LIU (+0.009)  \n3. Niall TREACY (+0.142)  \n4. Lorenzo PREVITALI (+1.100)  \n5. Long SUN (PEN)  \n\nNIEWINSKI surged from third at the start, overtaking on lap 4 to lead and hold off LIU in a tight finish. LIU closed fast but fell just short. TREACY edged past PREVITALI early and held third. SUN received a penalty, likely for interference. The top three battled closely until the final stretch.",
        "title": "Rep. Semifinals · Heat 2 (NED)"
      }
    },
    "8e64987b-7cd5-4d05-8b97-6655d3e142c4": {
      "NED": {
        "text": "1. Steven DUBOIS (41.681) – led from start to finish with strong early pace  \n2. Jordan PIERRE-GILLES (41.759, +0.078) – climbed from 4th to 2nd with fastest final lap  \n3. Roberts KRUZBERGS (41.800, +0.119) – steady third, dropped slightly at the end  \n4. Shogo MIYATA (55.649) – fell after Lap 1, continued but far behind  \n5. Brandon KIM (56.813) – crashed on Lap 3, lost major time  \n\nRace was decided early: Dubois bolted ahead in first lap and held off chase. Miyata’s fall and Kim’s crash removed two contenders. Pierre-Gilles closed hard for silver. Tight battle for podium spots until final straight.",
        "title": "Finals · Final A (NED)"
      }
    },
    "8f94c91d-93f1-42af-8e86-ee44622e6970": {
      "NED": {
        "text": "1. Oleh HANDEI (42.041) – led from start to finish, strong first lap set the tone.  \n2. Sean MCANUFF (42.555, +0.514) – started fourth, moved up early, steady pace.  \n3. Zhanshuo LOU (42.650, +0.609) – started fifth, improved gradually, closed well.  \n4. Robin BENDIG (43.176, +1.135) – dropped back after third lap, couldn't respond.  \n5. Miika KLEVSTUEN – no time, disqualified during final lap (likely for lane violation or contact).  \n\nRace was controlled by HANDEI throughout; top three clear, but KLEVSTUEN’s DQ opened advancement spot. No falls, tight racing behind leader.",
        "title": "Preliminaries · Heat 4 (NED)"
      }
    },
    "91b1628d-5a16-46e0-9f16-6880619b7d5e": {
      "NED": {
        "text": "1. Peter Jaszapaty (42.256) – led from lap 4 after starting third, strong final laps  \n2. Brendan Corey (42.311, +0.055) – steady climb, closed gap but just fell short  \n3. Zhanshuo Lou (42.450, +0.194) – improved gradually, held off last skater  \n4. Martin Kolec (44.364, +2.108) – led early but faded badly in final laps  \nAbzal Azhgaliyev disqualified (PEN), did not finish  \n\nRace was tight early, but Jaszapaty surged ahead on lap 4 and held the lead. No falls, but Azhgaliyev penalized for unknown reason. Top 3 very close at the end.",
        "title": "Rep. Semifinals · Heat 1 (NED)"
      }
    },
    "9e2cf475-8cab-43f2-8653-9ed5d401d37a": {
      "NED": {
        "text": "1. Steven DUBOIS (40.973) – led from start to finish with consistent laps.  \n2. Brandon KIM (41.058, +0.085) – steady second, closed slightly in final lap.  \n3. Shaoang LIU (41.095, +0.122) – third throughout, strong middle laps but couldn’t pass Kim.  \n4. Jens VAN ‘T WOUT (41.148, +0.175) – started slow in lane 5, moved up one spot late.  \n5. Itzhak DE LAAT (41.478, +0.505) – faded in final stretch despite decent start.  \nNo falls or penalties. Dubois dominated early; top two secured QA qualification. Tight battle for third, but no overtakes after first turn.",
        "title": "Semifinals · Heat 1 (NED)"
      }
    },
    "a0125825-c262-4504-8192-949dadfb6e9e": {
      "NED": {
        "text": "1. Tae Sung KIM (40.969) – led from start to finish, strong opening lap set the tone.  \n2. Oleh HANDEI (41.312, +0.343) – started third, steadily closed gap but couldn't challenge.  \n3. Martin KOLENC (41.467, +0.498) – held position throughout, consistent but no overtakes.  \n4. Marcus HOWARD (42.887, +1.918) – slow start, dropped early, faded late.  \nPietro SIGHEL penalized, did not finish.  \n\nNo falls, tight battle for second, but Kim dominated with clean, powerful skating. Qualifiers: Kim, Handei.",
        "title": "Heats · Heat 7 (NED)"
      }
    },
    "a3c5d5a3-fcfe-4f60-bdb7-4f37c69ec820": {
      "NED": {
        "text": "1. Niall Treacy (42.087) – led from start to finish with strong early pace, never challenged.  \n2. Fredrik Pedersen (+1.020) – started 4th, moved up to 3rd in first lap, steadily closed gap ahead.  \n3. Tobias Wolf (+1.536) – held 4th early, overtook Hammermuller on fourth lap for bronze position.  \n4. Jonas Hammermuller (+1.657) – began well in 2nd, faded slightly in final laps.  \n5. Eklavya Jagal (+2.303) – last throughout, consistent but no overtakes.  \nNo falls or penalties. Race settled early as Treacy pulled away quickly. Tight battle for 2nd and 3rd until final stretch.",
        "title": "Preliminaries · Heat 10 (NED)"
      }
    },
    "af201b61-57e2-4cb7-a185-6bfc53d8f0cd": {
      "NED": {
        "text": "1. Itzhak DE LAAT (NED) – 41.718  \n2. Diane SELLIER (FRA) – 41.909 (+0.191)  \n3. Lorenzo PREVITALI (ITA) – 41.928 (+0.210)  \n4. Stefan-Alexander KUMURDJIEV (BUL) – 42.714 (+0.996)  \n5. Peter MURPHY (IRL) – 43.557 (+1.839)  \n\nDiane SELLIER led from the start, but Itzhak DE LAAT surged in the final lap to take the win. PREVITALI nearly caught SELLIER for second, finishing just 0.019 seconds behind. No falls or penalties—tight racing throughout, with the top three covered by only 0.21 seconds.",
        "title": "Preliminaries · Heat 2 (NED)"
      }
    },
    "b5eeba18-c38c-438c-a270-742f37405284": {
      "NED": {
        "text": "1. Itzhak DE LAAT (NED) – 41.474  \n2. Stijn DESMET (BEL) – 41.596 (+0.122)  \n3. Michal NIEWINSKI (POL) – 41.970 (+0.496)  \n4. Yanghun Ben JUNG (USA) – 41.999 (+0.525)  \n5. Lucas WAREHAM (GBR) – 42.506 (+1.032)  \n\nMichal Niewinski led early, but De Laat surged in the final two laps to take the win. Desmet stayed close and overtook Niewinski in lap 4. No falls or penalties—tight racing throughout, with the top three separated by just half a second.",
        "title": "Heats · Heat 5 (NED)"
      }
    },
    "b8193a1b-4b72-458e-a340-27522d0bd8e8": {
      "NED": {
        "text": "1. Michal NIEWINSKI (41.911) – led from start to finish, strong first lap set the tone.  \n2. Lukas MACDONALD (42.329, +0.418) – steady second place, closed gap slightly but couldn't challenge.  \n3. Tobias WOLF (43.153, +1.242) – started fifth, overtook Morozov in final laps for third.  \n4. Yaroslav MOROZOV (43.234, +1.323) – held early position but lost ground late.  \nMarcus HOWARD penalized – no time, did not finish due to infringement.  \nRace was controlled by Niewinski; top two clear, battle for third tight until the end.",
        "title": "Rep. Quarterfinals · Heat 3 (NED)"
      }
    },
    "beea6adf-c5f7-4c9a-b0d6-f318d787e162": {
      "NED": {
        "text": "1. Jens VAN 'T WOUT (40.808) – led from start to finish with strong first lap  \n2. Shaoang LIU (+0.095) – stayed close throughout, consistent pace  \n3. Niall TREACY (+0.595) – steady third, no major moves  \n4. Lukasz KUCZYNSKI (+1.187) – faded slightly in final lap  \n5. Muhammed BOZDAG (+1.824) – last from early stages  \n\nNo falls or penalties. VAN 'T WOUT dominated the heat, opening a gap early that held to the end. LIU nearly closed the gap in the final stretch but couldn't challenge. Tight battle for qualification spots behind, but positions remained stable after Lap 1.",
        "title": "Heats · Heat 8 (NED)"
      }
    },
    "c7094c79-ab1a-427c-8c72-fea4f13ddbdb": {
      "NED": {
        "text": "1. Lukasz KUCZYNSKI (42.162) – led from start to finish with consistent laps.  \n2. Rostyslav LEONTENKO (42.232, +0.070) – steady second, closed slightly in final lap.  \n3. Jonathan MOODY (42.356, +0.194) – held third throughout, no major moves.  \n4. Kosei HAYASHI (42.379, +0.217) – started fifth, moved up early, strong middle laps.  \n5. Brandon Yan Kai POK (42.650, +0.488) – began well but faded in later laps.  \nNo falls or penalties. Race settled early—top three positions unchanged after first lap. Tight battle for second with less than 0.2s between 2nd and 4th.",
        "title": "Preliminaries · Heat 1 (NED)"
      }
    },
    "cab8b3e6-7699-4624-864f-117c0810d859": {
      "NED": {
        "text": "1. Shogo Miyata (40.857) – led from start to finish with consistent laps, controlled the race.  \n2. Jordan Pierre-Gilles (40.920, +0.063) – strong start, stayed close throughout, edged out Kruzbergs late.  \n3. Roberts Kruzbergs (40.997, +0.140) – solid pace but couldn’t challenge the top two.  \n4. Michal Niewinski (41.132), 5. Lorenzo Previtali (41.328), 6. Stijn Desmet (41.399).  \nNo falls or penalties. Miyata dominated early; top two secured qualification comfortably. Race decided in first lap, gap held until finish.",
        "title": "Quarterfinals · Heat 3 (NED)"
      }
    },
    "d03ad47e-c5ad-41b6-93a1-06a28fd3983b": {
      "NED": {
        "text": "1. Jordan PIERRE-GILLES (41.398) – led from start to finish, strong first lap set the tone.  \n2. Janghyuk PARK (41.545, +0.147) – started third, steady progress, surged late to secure second.  \n3. Long SUN (41.570, +0.172) – began well in second, couldn’t match final push.  \n4. Furkan AKAR (41.710, +0.312) – solid middle laps but faded slightly at the end.  \n5. Sean MCANUFF (42.232, +0.834) – last throughout, consistent but outpaced.  \nNo falls or penalties. Pierre-Gilles dominated early; PARK overtook SUN in final stretch for Q. Tight battle for second kept it exciting until the end.",
        "title": "Heats · Heat 4 (NED)"
      }
    },
    "d213a244-f6be-4a12-a620-65f0854e7439": {
      "NED": {
        "text": "1. Reinis BERZINS (42.016) – led from start to finish with consistent laps.  \n2. Peter JASZAPATI (+0.070) – stayed close throughout, strong second.  \n3. Warre NOIRON (+0.260) – steady performance, secured third.  \n4. Lucas Henry KOO (+1.403) – started slow, faded after first turn.  \n5. Munkh-Erdene ERDENEBILEG (+4.307) – struggled early, fell behind after Lap 2.  \n\nNo falls or penalties. BERZINS controlled the race; top two pulled away slightly in final laps. Tight battle for third until the end.",
        "title": "Preliminaries · Heat 8 (NED)"
      }
    },
    "d56e7ac6-c963-4672-9d1f-a2058f23fd9a": {
      "NED": {
        "text": "1. Shogo Miyata (40.883) – led from start to finish, smooth and consistent laps.  \n2. Roberts Kruzbergs (+0.060) – started third, surged late to secure second.  \n3. Denis Nikisha (+0.290) – strong early pace but faded slightly in final stretch.  \n4. Nico Andermann (+1.036) – steady performance, held position throughout.  \n5. Rostyslav Leontenko (+1.698) – struggled for speed, last by over a second.  \n\nNo falls or penalties. Miyata dominated early; battle for 2nd was close until the final lap.",
        "title": "Heats · Heat 2 (NED)"
      }
    },
    "db5d239e-8f4b-4831-a664-c2ac5df49667": {
      "NED": {
        "text": "1. Long SUN (41.509) – led from start to finish with consistent laps, controlled the race.  \n2. Sean MCANUFF (42.126, +0.617) – steady second, no challenges.  \n3. Yui MATSUBAYASHI (42.221, +0.712) – held third after brief mid-race pressure.  \n4. Joshua KAHL (42.372, +0.863) – improved from fifth, strong final lap.  \n5. Lucas WAREHAM (42.453, +0.944) – started well but faded late.  \nNo falls or penalties. SUN dominated early; top four stayed close until the end, but order remained stable.",
        "title": "Rep. Quarterfinals · Heat 2 (NED)"
      }
    },
    "e647cf4c-c345-4eb0-9384-86d73e8bc46a": {
      "NED": {
        "text": "1. Shaoang LIU (40.948)  \n2. Jens VAN 'T WOUT (41.096, +0.148)  \n3. Thomas NADALINI (41.183, +0.235)  \n4. Teun BOER (41.436, +0.488)  \n5. Andrew HEO (no time)  \n\nVan 't Wout led from the start, but Liu surged on lap 4 and powered through to win. The top three battled closely throughout, with tight gaps. Heo fell midway through the race and did not finish. No penalties; pure speed decided the heat.",
        "title": "Quarterfinals · Heat 2 (NED)"
      }
    },
    "f2811794-4016-4e42-aefb-fb55f427c33e": {
      "NED": {
        "text": "1. Adil GALIAKHMETOV (42.452)  \n2. Yanghun Ben JUNG (+0.118)  \n3. Radek FAJKUS (+0.186)  \n4. Liam O BRIEN (+0.532)  \n5. Warre VAN DAMME (+1.101)  \n\nFajkus led from the start, but Galiakhmetov surged in the final laps with strong cornering. Jung stayed close and overtook Fajkus early, but couldn’t match Galiakhmetov’s last lap. Tight battle for second held until the end. No falls or penalties. Race decided in the final stretch.",
        "title": "Preliminaries · Heat 7 (NED)"
      }
    },
    "f62ef0f7-d7f1-4ee5-8944-3bb40312d296": {
      "NED": {
        "text": "1. Abzal AZHGALIYEV (41.845)  \n2. Peter JASZAPATI (+0.048)  \n3. Rostyslav LEONTENKO (+0.511)  \n4. Chonlachart TAPROM (+1.259)  \n5. Huan-Chen LAI TSAI (no time)  \n\nAZHGALIYEV led from start to finish, opening a small gap early. JASZAPATI moved up from third to second by mid-race with a strong inside pass. LEONTENKO held third, while TAPROM faded late. LAI TSAI fell on lap 4 and did not finish. The top two advanced.",
        "title": "Rep. Quarterfinals · Heat 1 (NED)"
      }
    },
    "f9c03e3c-fa0d-481d-9714-652c34821ddc": {
      "NED": {
        "text": "1. Jiwon PARK (41.170)  \n2. William DANDJINOU (+0.080)  \n3. Abzal AZHGALIYEV (+0.336)  \n4. Shaolin LIU (+1.074)  \n5. Lukas MACDONALD (+1.224)  \n\nPARK and DANDJINOU led from the start, swapping positions early. DANDJINOU led after lap 3, but PARK surged ahead on lap 4 and held on to win. AZHGALIYEV stayed steady in third. LIU and MACDONALD trailed, with no falls or penalties. A tight battle for gold until the final straight.",
        "title": "Heats · Heat 3 (NED)"
      }
    },
    "fc0a7b60-4436-4ee7-bd86-54b841394c19": {
      "NED": {
        "text": "1. Lorenzo PREVITALI (41.905)  \n2. Nico ANDERMANN (+0.247)  \n3. Lucas Henry KOO (+0.690)  \n4. Maxim MAXIMOV (+2.446)  \n5. Lukasz KUCZYNSKI (+8.564)  \n\nPrevitali started strong from lane 2, overtaking Andermann after the second lap and pulling away with clean corners. Andermann led early but faded slightly in the final laps. Koo held steady in third, while Maximov struggled for speed. Kuczynski fell behind after lap 2 and never recovered. Race decided by mid-distance, no penalties or falls.",
        "title": "Rep. Quarterfinals · Heat 8 (NED)"
      }
    }
  },
  "team_codes": [
    "NED"
  ]
}